<template>
  <div class="send-form-page">
    <!-- Рендеринг для типу форми "consent_individual" -->
    <div v-if="formType === 'consent_individual'">
      <div class="title_form_from_user">
        <p>
          Інформована  згода клієнта на отримання послуги індивідуального психологічного консультування онлайн
        </p>
      </div>


      <!-- спеціальна розмітка для форми індивідуальної -->
      <form v-if="formFields.length > 0" @submit.prevent="submitForm">

        <div class="container-text-for-form">
          <div class="title_n_text">
            <b>Інформована згода психологічного консультування</b>
            <p>
              Цей документ інформує людину, що шукає допомоги у вирішенні психологічних або життєвих труднощів, іменована надалі як «Клієнт / ка», про особливості психологічного консультування та умови надання послуг.
            </p>
          </div>
          <div class="content_user_form">
            <span>Інформація про психолога</span>
            <p>
              Кох Катерина Мирославівна<br>
              Проводжу індивідуальні та парні психологічні консультації, а також індивідуальну та парну терапію. Створюю психологічні ігри для пар. Тренер психологічних курсів, проектів та груп (очно та онлайн)
            </p>
            <span>
              Кваліфікація
            </span>
            <p>
              Бакалавр Практичної  психології, спеціалізація кафедри «Медична психологія та Психофізіологія» (диплом бакалавра з відзнакою)<br>
              Магістр  Практичної психології (диплом магістра з відзнакою)<br>
              Член міжнародної асоціації ICEEFT - International Centre for Excellence in Emotionally Focused Therapy (Канада)<br>
            </p>
            <p>
              Додаткова кваліфікація: перинатальне та сімейне консультування; психосоматика: тілесно орієнтована психотерапія; емоційно-фокусована психотерапія (ICCEFT)
            </p>
            <span>
              Досвід роботи
            </span>
            <p>
              Консультування клієнтів і психотерапія з 2016 року. <br>
              Працюю в емоційно-фокусованому клієнтцентрованому підході.
            </p>
            <span>
              Психологічне консультування
            </span>
            <p>
              Психологічне консультування  - це спеціально організовані відносини, в яких окремі люди, сім'ї (пари) і групи досягають психічного, соціального і загального здоров'я, отримують нові знання і навички. Консультації засновані на ідеї, що зцілення відбувається в безпечних, та таких, що підтримують довірливі відносини, де неефективна поведінка і мислення людини змінюються на більш адаптивне (більш життєздатне). Мета психологічної консультації  - допомога клієнтам досягти їх цілей, поліпшити їх функціонування, особисті відносини, і запропонувати можливість росту та розвитку.
            </p>
            <span>
              Зміст послуги
            </span>
            <p>
              Катерина Кох (іменована далі як Психолог) бере на себе відповідальність допомогти клієнту /тці розібратися з ситуацією, в якій той /та  опинилися, і допомогти знайти внутрішні і зовнішні ресурси для її подолання. Психолог використовує професійні інструменти (методи і способи, якими вона навчалася) для допомоги клієнту /тці, пояснює клієнту /тці їх суть, інформує про їх особливості та можливі наслідки. Клієнт /тка може  не давати згоди на використання того чи іншого методу. Психолог не нав'язує свої духовні і світоглядні погляди клієнту /тці, не критикує і не оцінює клієнта / ку.
            </p>
            <span>
              Терапевтичні зустрічі (сесії/ серія психологічних консультацій)
            </span>
            <p>
              Частота зустрічей терапевта і клієнта / ки визначається за особистою домовленістю. Тривалість однієї зустрічі складає 60 хв (для індивідуального консультування) та 90 хв (для парного консультування). Винятки (наприклад, збільшення часу сесії при травматерапії) обговорюються додатково.
            </p>
            <p>
              Клієнт / ка бере на себе відповідальність приходити або виходити на зв'язок онлайн вчасно. У разі запізнення клієнта / ки, час сесії скорочується (психолог працює з клієнтом / кою той час, що залишився), і сесія/консультація  оплачується повністю.
            </p>
            <p>
              У разі неможливості прийти в призначений час клієнт / ка зобов'язується повідомити про це психолога <b>не менше ніж за 24 години</b> до призначеного йому / їй часу. Тоді психолог зможе віддати цей час іншій людині.
            </p>
            <p>
              Якщо клієнт / ка повідомляє про скасування сесії/ консультації менш, ніж за 24 години або пропускає сесію без попередження, то пропущена (скасований) сесія оплачується повністю, тому що ви зайняли в розкладі місце, яке міг би отримати хтось інший.
            </p>
            <span>
              Зв'язок з психологом
            </span>
            <p>
              Клієнт / ка може писати психологу для узгодження часу наступної зустрічі або роз'яснення домашнього завдання (при його наявності) в
              <ul>
                <li>Viber/ Telegram +380955634180</li>
                <li>Консультації відбуваються через додаток Zoom</li>
                <li>
                  В робочій сторінці Instagram:
                  <a href="https://instagram.com/kokh.kateryna" target="_blank" rel="noopener noreferrer">instagram.com/kokh.kateryna</a>
                </li>
                <li>
                  або на електронну скриньку:
                  <a href="mailto:katyakokhpsychologist@gmail.com">katyakokhpsychologist@gmail.com</a>
                </li>
              </ul>
            </p>
            <p>
              Якщо під час такого звернення у психолога проходить сесія/ консультація з іншим клієнтом, групова робота або відрядження, можна відповідати не відразу. Дзвінки можливі тільки в разі потреби, термінового скасування зустрічі за тел. +380955634180 (Viber/Telegram).
            </p>
            <p>
              Якщо питання клієнта / ки не пов'язаний з уточненням часу зустрічі або Психолог не робить екстрену психологічну допомогу. У ситуаціях кризи, коли клієнту /тці потрібна термінова допомога він / вона повинні звертатися до місцевого лікаря-психотерапевта або в службу психологічної підтримки:
              <br><br>
              в Україні: 0 800 50 77 50 <br>
              в Польщі: 48 58 524 76 02 <br>
              в Ізраїлі 1 800 22 33 77 <br>
              в США: 1 855 57 57 700 <br>
              Якщо вам потрібна екстрена психіатрична допомога, телефонуйте 103 (в Україні).
            </p>
            <span>
              Ставлення до психологічного консультування
            </span>
            <p>
              Клієнту/ тці важливо розуміти, що повнота і достовірність його / її відповідей і всієї інформації, яку клієнт / ка надає про себе, впливають на ефективність психологічного консультування/терапії. Тому клієнт / ка бере на себе зобов'язання бути з психологом щирим /ою, і за допомогою психолога ясно сформулювати те, яких результатів хоче досягти в спільній роботі з психологом.
            </p>
            <p>
              Клієнт / ка має право не надавати інформацію або частину інформації про себе, не пояснюючи причин. Однак в цьому випадку слід розуміти, що подальша консультування/терапія може бути ускладнена або неможлива.
            </p>
            <p>
              Клієнт / ка має право слідувати рекомендаціям психолога в рамках принципу свободи сумління. Якщо якісь приписи психолога вступають в протиріччя зі світоглядом та сумлінням клієнта / ки, то він / а може відмовитися від виконання цих приписів, але зобов'язується чесно і відкрито обговорити це з психологом.
            </p>
            <span>
              Клієнт / ка також має право
            </span>
            <p>
              <ul>
                <li>Виносити на обговорення і в роботу будь-яку хвилюючу його / її тему;</li>
                <li>Не працювати над собою і не виконувати домашні завдання;</li>
                <li>Відмовитися від участі в пропонованих методиках;</li>
                <li>Не відповідати на питання, на який не готовий / а відповісти.</li>
              </ul>
              Психолог бере на себе відповідальність безроздільно приділяти клієнтові / тці час, відведений йому / їй під час сесій/консультації, не відволікаючись на сторонні процеси і не перериваючи сесію.
              Психолог має право не давати порад і рекомендацій, оскільки такого підходу вимагає сам формат психологічного консультування.
              Психолог створює умови для самостійного аналізу клієнтом/ ою власної ситуації/ проблеми/питання.
            </p>
            <span>
              Ризики та можливі ускладнення в психологічному консультуванні
            </span>
            <p>
              Клієнту /тці важливо розуміти, що процес психологічного консультування буває дискомфортним і може викликати неприємні почуття: смуток, вину, сором, хвилювання, гнів, злість, розчарування, самотність і інші. Клієнт / ка може згадувати неприємні події під час терапії, після чого неприємні почуття можуть зберігатися кілька днів. Це нормально і зазвичай проходить при виконанні рекомендацій, отриманих від психолога. Іноді проблема може тимчасово погіршитися на початку психологічного консультування. Ця реакція також нормальна і логічна, коли людина намагається зробити серйозні життєві зміни.
              <br> Є також ризик того, що психолог не зможе допомогти клієнту /тці. Такі випадки обговорюються, і психолог може надати клієнту / ці допомогу в пошуку іншого фахівця.
            </p>
            <span>
              Відносини клієнта і психолога
            </span>
            <p>
              Протягом всього часу психологічного консультування клієнт / ка і психолог знаходяться у терапевтичних відносинах один з одним. Це означає, що незважаючи на те, що виникає під час сесій психологічна близькість, рівень відносин між психологом і клієнтом / кою може носити виключно професійний характер і обмежується лише рамками консультаційних сесій.
            </p>
            <p>
              Всі спроби встановити дружні, романтичні, публічні і інші відносини повинні припинятися. (Винятки повинні обговорюватися - наприклад: спільне відвідування громадських акцій, заходів, приналежність до однієї  і тієї ж спільноти, громади і т.д.. У подібних випадках психолог не ініціюватиме контакт). У разі якщо психолог зустрічає клієнта / ку поза свого кабінету, психолог не ініціює бесіди, а клієнт / ка може спокійно проігнорувати психолога і навіть не привітатися для гарантії конфіденційності.
            </p>
            <span>
              Конфіденційність інформації
            </span>
            <p>
              Вся інформація, отримана психологом від клієнта / ки, а також подробиці їхньої спільної роботи зберігаються в таємниці від третіх осіб (друзі, члени сім'ї, роботодавці та ін.) І організацій (податкова інспекція, поліція, і ін.). Психолог бере на себе зобов'язання захищати клієнта / ку від поширення конфіденційної інформації, за винятком випадків, коли існує загроза для безпеки клієнта, наприклад самогубство або безпеки інших осіб, наприклад, планування вбивства. У цих випадках психолог повинен зв'язатися з відповідними службами, і конфіденційність інформації може бути порушена.
              <br>
              Для підвищення ефективності роботи з клієнтом / кой і зростання свого професійного рівня психолог може з дозволу клієнта / ки ділитися отриманою інформацією зі своїми супервізорами або на інтервізійних зустрічах з колегами. При цьому персональні дані клієнта / ки (прізвище, ім'я, адреса, місце роботи, навчання, життєві обставини і ін) зберігаються в таємниці. Клієнту / тці також можуть час від часу пропонувати заповнити оціночну анкету процесу психотерапії. Ця інформація теж є конфіденційною. Така допомога клієнта /ки дуже цінна для поліпшення послуг консультування і психотерапії. В екстрених випадках, коли клієнту / тці потрібна термінова допомога, психолог може контактувати з людиною, який вказаний клієнтом в списку екстрених контактів.
            </p>
            <span>
              Оплата послуг
            </span>
            <p>
              Психолог надає послуги індивідуального консультування  вартістю  <b>4200 грн за одну  консультацію індивідуального консультування онлайн при короткостроковому консультуванні (до 12 онлайн- зустрічей)</b>
            </p>
            <p>
              Якщо психолог і клієнт узгоджують пролонговану у часі роботу <b>(формат терапевтичного альянсу на 20 зустрічей)</b>, та підписують інформовану
              договірну згоду на <b>довгострокове консультування</b>  - вартість послуги індивідуального консультування
              становить:
              <br>
              При терапевтичному альянсі <b>20 консультації - 3300 грн за одну консультацію</b> <br>
              Для клієнтів, які проживають в інших країнах відповідно: <br>
              Психолог надає послуги індивідуального консультування  вартістю  110€/110$ <b>за одну консультацію індивідуального консультування онлайн.</b>
              <br>
              При терапевтичному альянсі <b>20 консультації</b> - 90€/90$
            </p>
            <p>
              Розмір оплати може бути переглянутий в залежності від професійного зростання психолога і індивідуальної ситуації клієнта / ки. Проте розмір оплати при пролонгований роботі (формат терапевтичного альянсу короткостроковий (від 1 до 12 зустрічей) та довгостроковий (20 зустрічей)) не змінюється до завершення крайньої сесії із серії консультацій.
            </p>
            <p>
              <b>Якщо клієнт / ка не має можливості прийти на зустріч, він / а зобов'язується повідомити про це психотерапевта не пізніше як за 24 години до призначеного йому / їй часу. Якщо цього не відбудеться, клієнт / ка зобов'язується оплатити сесію, яку він / а пропустив / а.</b> Психолог має право скасувати зустріч і вимагати оплати своїх послуг, якщо клієнт / ка спізнюється на 30хв  і більше хвилин.
            </p>
            <span>
              Аудіо та відеозапис
            </span>
            <p>
              При бажанні клієнт / ка може вести аудіо або відеозапис зустрічі, погодивши це з психологом. Отримані записи клієнт / ка зобов'язується використовувати виключно особисто без передачі частково або повністю третім особам, не публікувати ні в якій формі, не розміщувати на загальнодоступних ресурсах і не використовувати в комерційних цілях.
              <br>
              Запис психологом індивідуальної сесії клієнта(ки) є обов’язковим.  Клієнт(ка) погоджуючись на умови даної інформованої згоди,- <b>даю згоду використовувати відео/аудіозаписи сесій моєї психотерапії для поліпшення практики терапії.</b> Використання і перегляд аудіо/відеозаписів сесій строго обмежено наступними цілями:
              <br>
              (1) Аналіз випадку для оптимізації якості наданої допомоги. <br>
              (2) Використання матеріалу з метою отримання професійної консультації щодо випадку клієнта/ки. <br>
              Тільки психотерапевту/супервізору, який не знає клієнта(ку), дозволено переглядати записи. Записи не є частиною постійної психологічної карти клієнта/ки. Психолог знищить кожен запис після того, як його буде використано за прямим призначенням.
            </p>
            <span>
              Припинення терапії
            </span>
            <p>
              Клієнт / ка може відмовитися від послуг психолога, якщо відчує, що здатний / а протистояти життєвим труднощам без підтримки.
              <br>
              Клієнт / ка має право відмовитися від послуг психолога без пояснення причин. Однак, <b>зобов'язується сповістити про своє рішення психолога.</b> У цьому випадку клієнт / ка і психолог <b>призначають заключну зустріч-консультацію.</b> На цій сесії проводиться обговорення досягнутих результатів клієнтом/ою; аналіз динаміки процесу психологічного консультування.
              <br>
              Психолог може відмовитися від роботи з клієнтом / кою  або змінити умови оплати своїх послуг, якщо клієнт / ка демонструє низьку зацікавленість у спільній роботі з психологом.
              Наприклад, якщо: <br>
              <ul>
                <li>Клієнт / ка систематично запізнюється (2-3 рази поспіль) без вагомих причин;</li>
                <li>Клієнт / ка завчасно не попереджає про своє запізнення або відсутності можливості прийти на зустріч;</li>
                <li>Клієнт / ка не оплачує щонайменше одну консультацію, що відбулася.</li>
              </ul>
            </p>
            <span>
              Перенесення терапії та паузи у терапії
            </span>
            <p>
              Клієнт/ка може <b>взяти паузу у терапії на період відпустки тривалістю до 2 тижнів</b> зі збереженням свого клієнтського місця та умов оплати.
              <br>
              Клієнт/ка <b>має право безоплатно перенести свою консультацію на інший день - 2 змоги  чи перенести консультацію на наступний тиждень на свій день та час - 2 змоги.</b>
              <br>
              <b>Якщо клієнт/ка вичерпали свій ліміт вказаний вище</b>,- функція безоплатного перенесення вже є не доступною. <b>Наступні перенесення консультацій оплачуються 50% вартості основної консультації.</b>
              При короткостроковому консультуванні вартість перенесення консультації вартуватиме - 2100 грн (55$/55€)
              <br>
              При довгостроковому консультуванні вартість перенесення консультації вартуватиме - 1650 грн (45$/45€)
            </p>
            <span>
              Психолог працює із психічно здоровими людьми
            </span>
            <p>
              Психолог також може відмовитися від роботи з клієнтом / кою, якщо запит клієнта / ки вимагає участі спеціалістів з медичною освітою, фахівців з іншої спеціалізацій або більш високим рівнем професійної підготовки в даному питанні.
            </p>
            <p>
              Клієнт / ка також розуміє, що психолог може відмовитися від роботи з клієнтом / кою і рекомендувати іншого фахівця, якщо: у клієнта / ки високий ризик суїциду або вбивства, нанесення шкоди собі, проблеми з важкими формами фізичного і сексуального насильства, ситуація вимагає психіатричної госпіталізації, ситуація вимагає постійної уваги, ситуація вимагає оцінки психіатра, ситуація активного психозу.
            </p>
            <span>
              Етичний кодекс психолога
            </span>
            <p>
              Психолог працює в рамках Етичного кодексу психолога.
              За Етичним кодексом психолога,- <b>психолог зобов'язується дотримуватися конфіденційності інформації клієнта; обирати, ті способи та методи психотерапії, які найкраще можуть допомогти клієнту/тці вирішити власну проблему/ситуацію/питання.</b>
            </p>
          </div>
        </div>

        <div v-for="(field, index) in formFields" :key="index">

          <!-- Для не-boolean типів поля -->
          <div v-if="field.field_type !== 'boolean'" class="input-field-text">
            <div class="container-input_froms_user">
              <label :for="`field-${index}`">{{ field.field_name }}</label>
              <input :id="`field-${index}`" type="text" v-model="field.value" required placeholder="Ваша відповідь"/>
            </div>
          </div>

          <!-- Для boolean типів поля -->
          <div v-if="field.field_type === 'boolean'" class="checkbox-field">
            <div class="container-input center_group">
              <div class="checkbox-group width-input-1200">
                <label class="custom-checkbox" :for="`field-${index}`">
<!--                  <input :id="`field-${index}`" type="checkbox" v-model="field.value"  required>-->
                  <input :id="`field-${index}`" type="checkbox" :checked="field.value" @change="checkboxChanged(field, $event)" required>
                  <span class="checkmark">
                    <svg class="svg-checkmark" xmlns="http://www.w3.org/2000/svg" width="35" height="35" viewBox="0 0 35 35" fill="none">
                      <path class="checkmark-path" d="M5.83301 18.9585L13.1247 26.2502L29.1663 10.2085" stroke="white" stroke-width="3" stroke-linecap="round" stroke-dasharray="32.99833297729492" stroke-dashoffset="32.99833297729492"/>
                    </svg>
                  </span>
                  <p>{{ field.field_name }}</p>
                </label>
              </div>
            </div>
          </div>

        </div>
        <div class="container-global-form-edit width-container_for_butt">
          <button
              class="global-form-edit"
              type="submit"
              :class="{ 'button-disabled': !isCheckboxChecked }"
              :disabled="!isCheckboxChecked">
            <span class="edit-link">Надіслати</span>
          </button>
        </div>
      </form>
      <div v-else>
        <p>Завантаження форми...</p>
      </div>
    </div>

    <!-- Рендеринг для типу форми "consent_couple" -->
    <div v-if="formType === 'consent_couple'">
      <div class="title_form_from_user">
        <p>
          Інформована згода клієнта на отримання послуги парного психологічного консультування онлайн
        </p>
      </div>

      <!-- спеціальна розмітка для парної форми -->
      <form v-if="formFields.length > 0" @submit.prevent="submitForm">

        <div class="container-text-for-form">
          <div class="title_n_text">
            <b>Інформована згода психологічного консультування</b>
            <p>
              Цей документ інформує людину, що шукає допомоги у вирішенні психологічних або життєвих труднощів, іменована надалі як «Клієнт / ка», про особливості психологічного консультування та умови надання послуг.
            </p>
          </div>
          <div class="content_user_form">
            <span>Інформація про психолога</span>
            <p>
              Кох Катерина Мирославівна<br>
              Проводжу індивідуальні та парні психологічні консультації, а також індивідуальну та парну терапію. Створюю психологічні ігри для пар. Тренер психологічних курсів, проектів та груп (очно та онлайн)
            </p>
            <span>
              Кваліфікація
            </span>
            <p>
              Бакалавр Практичної  психології, спеціалізація кафедри «Медична психологія та Психофізіологія» (диплом бакалавра з відзнакою)<br>
              Магістр  Практичної психології (диплом магістра з відзнакою)<br>
              Член міжнародної асоціації ICEEFT - International Centre for Excellence in Emotionally Focused Therapy (Канада)<br>
            </p>
            <p>
              Додаткова кваліфікація: перинатальне та сімейне консультування; психосоматика: тілесно орієнтована психотерапія; емоційно-фокусована психотерапія (ICCEFT)
            </p>
            <span>
              Досвід роботи
            </span>
            <p>
              Консультування клієнтів і психотерапія з 2016 року. <br>
              Більше про види парного консультування та для кого вони можуть бути корисними -
              <a href="https://psy-kokh.online">www.psy-kokh.online</a> <br>
              Працюю в методі ЕФТ - емоційно-фокусована психотерапія для пар
              Більше про метод на сайті ICEEFT - <a href="https://www.iceeft.com">www.iceeft.com</a>
            </p>
            <span>
              Психологічне консультування
            </span>
            <p>
              Психологічне консультування  - це спеціально організовані відносини, в яких окремі люди, сім'ї (пари) і групи досягають психічного, соціального і загального здоров'я, отримують нові знання і навички. Консультації засновані на ідеї, що зцілення відбувається в безпечних, та таких, що підтримують довірливі відносини, де неефективна поведінка і мислення людини змінюються на більш адаптивне (більш життєздатне). Мета психологічної консультації  - допомога клієнтам досягти їх цілей, поліпшити їх функціонування, особисті відносини, і запропонувати можливість росту та розвитку.
            </p>
            <span>
              Зміст послуги
            </span>
            <p>
              Катерина Кох (іменована далі як Психолог) бере на себе відповідальність допомогти клієнту /тці розібратися з ситуацією, в якій той /та  опинилися, і допомогти знайти внутрішні і зовнішні ресурси для її подолання. Психолог використовує професійні інструменти (методи і способи, якими вона навчалася) для допомоги клієнту /тці, пояснює клієнту /тці їх суть, інформує про їх особливості та можливі наслідки. Клієнт /тка може  не давати згоди на використання того чи іншого методу. Психолог не нав'язує свої духовні і світоглядні погляди клієнту /тці, не критикує і не оцінює клієнта / ку.
            </p>
            <span>
              Терапевтичні зустрічі (сесії/ серія психологічних консультацій)
            </span>
            <p>
              Частота зустрічей терапевта і клієнта / ки визначається за особистою домовленістю. Тривалість однієї зустрічі складає 60 хв (для індивідуального консультування) та 90 хв (для парного консультування). Винятки (наприклад, збільшення часу сесії при травматерапії) обговорюються додатково.
            </p>
            <p>
              Клієнт / ка бере на себе відповідальність приходити або виходити на зв'язок онлайн вчасно. У разі запізнення клієнта / ки, час сесії скорочується (психолог працює з клієнтом / кою той час, що залишився), і сесія/консультація  оплачується повністю.
            </p>
            <p>
              У разі неможливості прийти в призначений час клієнт / ка зобов'язується повідомити про це психолога <b>не менше ніж за 24 години</b> до призначеного йому / їй часу. Тоді психолог зможе віддати цей час іншій людині.
            </p>
            <p>
              Якщо клієнт / ка повідомляє про скасування сесії/ консультації менш, ніж за 24 години або пропускає сесію без попередження, то пропущена (скасований) сесія оплачується повністю, тому що ви зайняли в розкладі місце, яке міг би отримати хтось інший.
            </p>
            <span>
              Зв'язок з психологом
            </span>
            <p>
              Клієнт / ка може писати психологу для узгодження часу наступної зустрічі або роз'яснення домашнього завдання (при його наявності) в
              <ul>
                <li>Viber/ Telegram +380955634180</li>
                <li>Консультації відбуваються через додаток Zoom</li>
                <li>
                  В робочій сторінці Instagram:
                  <a href="https://instagram.com/kokh.kateryna" target="_blank" rel="noopener noreferrer">instagram.com/kokh.kateryna</a>
                </li>
                <li>
                  або на електронну скриньку:
                  <a href="mailto:katyakokhpsychologist@gmail.com">katyakokhpsychologist@gmail.com</a>
                </li>
              </ul>
            </p>
            <p>
              Якщо під час такого звернення у психолога проходить сесія/ консультація з іншим клієнтом, групова робота або відрядження, можна відповідати не відразу. Дзвінки можливі тільки в разі потреби, термінового скасування зустрічі за тел. +380955634180 (Viber/Telegram).
            </p>
            <p>
              Якщо питання клієнта / ки не пов'язаний з уточненням часу зустрічі або Психолог не робить екстрену психологічну допомогу. У ситуаціях кризи, коли клієнту /тці потрібна термінова допомога він / вона повинні звертатися до місцевого лікаря-психотерапевта або в службу психологічної підтримки:
              <br><br>
              в Україні: 0 800 50 77 50 <br>
              в Польщі: 48 58 524 76 02 <br>
              в Ізраїлі 1 800 22 33 77 <br>
              в США: 1 855 57 57 700 <br>
              Якщо вам потрібна екстрена психіатрична допомога, телефонуйте 103 (в Україні).
            </p>
            <span>
              Ставлення до психологічного консультування
            </span>
            <p>
              Клієнту/ тці важливо розуміти, що повнота і достовірність його / її відповідей і всієї інформації, яку клієнт / ка надає про себе, впливають на ефективність психологічного консультування/терапії. Тому клієнт / ка бере на себе зобов'язання бути з психологом щирим /ою, і за допомогою психолога ясно сформулювати те, яких результатів хоче досягти в спільній роботі з психологом.
            </p>
            <p>
              Клієнт / ка має право не надавати інформацію або частину інформації про себе, не пояснюючи причин. Однак в цьому випадку слід розуміти, що подальша консультування/терапія може бути ускладнена або неможлива.
            </p>
            <p>
              Клієнт / ка має право слідувати рекомендаціям психолога в рамках принципу свободи сумління. Якщо якісь приписи психолога вступають в протиріччя зі світоглядом та сумлінням клієнта / ки, то він / а може відмовитися від виконання цих приписів, але зобов'язується чесно і відкрито обговорити це з психологом.
            </p>
            <span>
              Клієнт / ка також має право
            </span>
            <p>
              <ul>
                <li>Виносити на обговорення і в роботу будь-яку хвилюючу його / її тему;</li>
                <li>Не працювати над собою і не виконувати домашні завдання;</li>
                <li>Відмовитися від участі в пропонованих методиках;</li>
                <li>Не відповідати на питання, на який не готовий / а відповісти.</li>
              </ul>
              Психолог бере на себе відповідальність безроздільно приділяти клієнтові / тці час, відведений йому / їй під час сесій/консультації, не відволікаючись на сторонні процеси і не перериваючи сесію.
              Психолог має право не давати порад і рекомендацій, оскільки такого підходу вимагає сам формат психологічного консультування.
              Психолог створює умови для самостійного аналізу клієнтом/ ою власної ситуації/ проблеми/питання.
            </p>
            <span>
              Ризики та можливі ускладнення в психологічному консультуванні
            </span>
            <p>
              Клієнту /тці важливо розуміти, що процес психологічного консультування буває дискомфортним і може викликати неприємні почуття: смуток, вину, сором, хвилювання, гнів, злість, розчарування, самотність і інші. Клієнт / ка може згадувати неприємні події під час терапії, після чого неприємні почуття можуть зберігатися кілька днів. Це нормально і зазвичай проходить при виконанні рекомендацій, отриманих від психолога. Іноді проблема може тимчасово погіршитися на початку психологічного консультування. Ця реакція також нормальна і логічна, коли людина намагається зробити серйозні життєві зміни.
              <br> Є також ризик того, що психолог не зможе допомогти клієнту /тці. Такі випадки обговорюються, і психолог може надати клієнту / ці допомогу в пошуку іншого фахівця.
            </p>
            <span>
              Відносини клієнта і психолога
            </span>
            <p>
              Протягом всього часу психологічного консультування клієнт / ка і психолог знаходяться у терапевтичних відносинах один з одним. Це означає, що незважаючи на те, що виникає під час сесій психологічна близькість, рівень відносин між психологом і клієнтом / кою може носити виключно професійний характер і обмежується лише рамками консультаційних сесій.
            </p>
            <p>
              Всі спроби встановити дружні, романтичні, публічні і інші відносини повинні припинятися. (Винятки повинні обговорюватися - наприклад: спільне відвідування громадських акцій, заходів, приналежність до однієї  і тієї ж спільноти, громади і т.д.. У подібних випадках психолог не ініціюватиме контакт). У разі якщо психолог зустрічає клієнта / ку поза свого кабінету, психолог не ініціює бесіди, а клієнт / ка може спокійно проігнорувати психолога і навіть не привітатися для гарантії конфіденційності.
            </p>
            <span>
              Конфіденційність інформації
            </span>
            <p>
              Вся інформація, отримана психологом від клієнта / ки, а також подробиці їхньої спільної роботи зберігаються в таємниці від третіх осіб (друзі, члени сім'ї, роботодавці та ін.) І організацій (податкова інспекція, поліція, і ін.). Психолог бере на себе зобов'язання захищати клієнта / ку від поширення конфіденційної інформації, за винятком випадків, коли існує загроза для безпеки клієнта, наприклад самогубство або безпеки інших осіб, наприклад, планування вбивства. У цих випадках психолог повинен зв'язатися з відповідними службами, і конфіденційність інформації може бути порушена.
              <br>
              Для підвищення ефективності роботи з клієнтом / кой і зростання свого професійного рівня психолог може з дозволу клієнта / ки ділитися отриманою інформацією зі своїми супервізорами або на інтервізійних зустрічах з колегами. При цьому персональні дані клієнта / ки (прізвище, ім'я, адреса, місце роботи, навчання, життєві обставини і ін) зберігаються в таємниці. Клієнту / тці також можуть час від часу пропонувати заповнити оціночну анкету процесу психотерапії. Ця інформація теж є конфіденційною. Така допомога клієнта /ки дуже цінна для поліпшення послуг консультування і психотерапії. В екстрених випадках, коли клієнту / тці потрібна термінова допомога, психолог може контактувати з людиною, який вказаний клієнтом в списку екстрених контактів.
            </p>
            <span>
              Оплата послуг
            </span>
            <p>
              Психолог надає послуги парного консультування у двох форматах
            </p>
            <table>
              <tr>
                <th>Тип послуги</th>
                <th>Ціна за одну консультацію</th>
                <th>Ціна в іншій валюті</th>
              </tr>
              <tr>
                <td>Короткостроковий формат парного консультування (до 10 парних консультацій)</td>
                <td>4600 грн</td>
                <td>125$/125€</td>
              </tr>
              <tr>
                <td>Довгостроковий формат парного консультування / Парна психотерапія (40 парних консультацій)</td>
                <td>3700 грн</td>
                <td>97$/97€</td>
              </tr>
            </table>

            <p>До початку співпраці клієнт/ка обирають бажаний формат співпраці та повідомляють
              про це психолога.</p>
            <p>
              Формат співпраці передбачає по 2-3 індивідуальні діагностичні сесії для кожного з пари після першої консультації.
            </p>

            <table>
              <tr>
                <th>Тип послуги</th>
                <th>Ціна за одну консультацію</th>
                <th>Ціна в іншій валюті</th>
              </tr>
              <tr>
                <td>Вартість індивідуальної діагностичної сесії парного процесу</td>
                <td>2500 грн</td>
                <td>67$/67€</td>
              </tr>
            </table>
            <p>
              Розмір оплати може бути переглянутий в залежності від професійного зростання психолога і індивідуальної ситуації клієнта / ки. Проте розмір оплати при пролонгований роботі (формат терапевтичного альянсу короткостроковий (від 1 до 12 зустрічей) та довгостроковий (20 зустрічей)) не змінюється до завершення крайньої сесії із серії консультацій.
            </p>
            <p>
              <b>Якщо клієнт / ка не має можливості прийти на зустріч, він / а зобов'язується повідомити про це психотерапевта не пізніше як за 24 години до призначеного йому / їй часу. Якщо цього не відбудеться, клієнт / ка зобов'язується оплатити сесію, яку він / а пропустив / а.</b> Психолог має право скасувати зустріч і вимагати оплати своїх послуг, якщо клієнт / ка спізнюється на 30хв  і більше хвилин.
            </p>
            <span>
              Аудіо та відеозапис
            </span>
            <p>
              При бажанні клієнт / ка може вести аудіо або відеозапис зустрічі, погодивши це з
              психологом. Отримані записи клієнт / ка зобов'язується використовувати виключно
              особисто без передачі частково або повністю третім особам, не публікувати ні в якій
              формі, не розміщувати на загальнодоступних ресурсах і не використовувати в
              комерційних цілях.
            </p>
            <p>
              Психолог проводить відеозапис консультацій.
            </p>
            <p>
              Підписуючи цю інформовану згоду, клієнт(ка) <b>дають згоду на запис консультацій та
              право використовувати відео/аудіозаписи парних сесій психотерапії для
              поліпшення практики парної терапії.</b> Використання і перегляд аудіо/відеозаписів
              сесій строго обмежено наступними цілями: <br>
              (1) Аналіз випадку для оптимізації якості наданої допомоги парі. <br>
              (2) Використання матеріалу з метою отримання професійної консультації щодо випадку
              клієнта/ки.<br>
              (3) Використання матеріалу з метою проведення групової супервізії з іншими
              професійними терапевтами <br>
              Тільки психотерапевту/супервізору, який не знає пару, дозволено переглядати записи.
              Записи не є частиною постійної психологічної карти пари клієнта/ки. Психолог знищить
              кожен запис після того, як його буде використано за прямим призначенням.
            </p>
            <span>
              Припинення терапії
            </span>
            <p>
              Клієнт / ка може відмовитися від послуг психолога, якщо відчує, що здатний / а протистояти життєвим труднощам без підтримки.
              <br>
              Клієнт / ка має право відмовитися від послуг психолога без пояснення причин. Однак, <b>зобов'язується сповістити про своє рішення психолога.</b> У цьому випадку клієнт / ка і психолог <b>призначають заключну зустріч-консультацію.</b> На цій сесії проводиться обговорення досягнутих результатів клієнтом/ою; аналіз динаміки процесу психологічного консультування.
              <br>
              Психолог може відмовитися від роботи з клієнтом / кою  або змінити умови оплати своїх послуг, якщо клієнт / ка демонструє низьку зацікавленість у спільній роботі з психологом.
              Наприклад, якщо: <br>
              <ul>
                <li>Клієнт / ка систематично запізнюється (2-3 рази поспіль) без вагомих причин;</li>
                <li>Клієнт / ка завчасно не попереджає про своє запізнення або відсутності можливості прийти на зустріч;</li>
                <li>Клієнт / ка систематично не виконує домашні завдання, коли цього вимагає підхід, в якому працює психолог;</li>
                <li>Клієнт / ка не оплачує щонайменше одну консультацію, що відбулася.</li>
              </ul>
            </p>
            <span>
              Перенесення терапії та паузи у терапії
            </span>
            <table>
              <tr>
                <th>Короткостроковий формат парного консультування (до 10 парних консультацій)</th>
              </tr>
            </table>
            <p>
              Клієнт/ка може <b>взяти паузу у терапії на період відпустки тривалістю до 2 тижнів</b> -
              зі збереженням свого клієнтського місця та умов оплати.
              <br>
              <b>Клієнт/ка має право безоплатно перенести свою консультацію на інший день - 1
              змога чи перенести консультацію на наступний тиждень на свій день та час - 1
              змога</b> - зі збереженням свого клієнтського місця та умов оплати.
              <br>
              <b>Якщо клієнт/ка вичерпали свій ліміт вказаний вище</b>,- функція безоплатного
              перенесення вже є не доступною. <b>Наступні перенесення консультацій оплачуються
              50% вартості основної консультації</b>.
              <br>
              При короткостроковому парному консультуванні вартість перенесення консультації
              вартуватиме - 2300 грн (63$/63€)
            </p>
            <table>
              <tr>
                <th>Довгостроковий формат парного консультування /парна психотерапія
                  (40 парних консультацій)
                </th>
              </tr>
            </table>
            <p>
              Клієнт/ка може <b>взяти паузу у терапії на період відпустки тривалістю до 2 тижнів - 2
              змоги</b> зі збереженням свого клієнтського місця та умов оплати.
              <br>
              <b>Клієнт/ка має право безоплатно перенести свою консультацію на інший день - 2
              змоги чи перенести консультацію на наступний тиждень на свій день та час - 2
              змоги</b> зі збереженням свого клієнтського місця та умов оплати.
              <br>
              <b>Якщо клієнт/ка вичерпали свій ліміт вказаний вище</b>,- функція безоплатного
              перенесення вже є не доступною. <b>Наступні перенесення консультацій оплачуються
              50% вартості основної консультації</b>.
              <br>
              При довгостроковому парному консультуванні вартість перенесення консультації
              вартуватиме - 1850 грн (49$/49€)
            </p>
            <span>
              Психолог працює із психічно здоровими людьми
            </span>
            <p>
              Психолог також може відмовитися від роботи з клієнтом / кою, якщо запит клієнта / ки вимагає участі спеціалістів з медичною освітою, фахівців з іншої спеціалізацій або більш високим рівнем професійної підготовки в даному питанні.
            </p>
            <p>
              Клієнт / ка також розуміє, що психолог може відмовитися від роботи з клієнтом / кою і рекомендувати іншого фахівця, якщо: у клієнта / ки високий ризик суїциду або вбивства, нанесення шкоди собі, проблеми з важкими формами фізичного і сексуального насильства, ситуація вимагає психіатричної госпіталізації, ситуація вимагає постійної уваги, ситуація вимагає оцінки психіатра, ситуація активного психозу.
            </p>
            <span>
              Етичний кодекс психолога
            </span>
            <p>
              Психолог працює в рамках Етичного кодексу психолога.
              За Етичним кодексом психолога,- <b>психолог зобов'язується дотримуватися конфіденційності інформації клієнта; обирати, ті способи та методи психотерапії, які найкраще можуть допомогти клієнту/тці вирішити власну проблему/ситуацію/питання.</b>
            </p>
          </div>
        </div>


        <div v-for="(field, index) in formFields" :key="index">

          <!-- Для не-boolean типів поля -->
          <div v-if="field.field_type !== 'boolean'" class="input-field-text">
            <div class="container-input_froms_user">
              <label :for="`field-${index}`">{{ field.field_name }}</label>
              <input :id="`field-${index}`" type="text" v-model="field.value" required placeholder="Ваша відповідь"/>
            </div>
          </div>

          <!-- Для boolean типів поля -->
          <div v-if="field.field_type === 'boolean'" class="checkbox-field">
            <div class="container-input center_group">
              <div class="checkbox-group width-input-1200">
                <label class="custom-checkbox" :for="`field-${index}`">
                  <!--                  <input :id="`field-${index}`" type="checkbox" v-model="field.value"  required>-->
                  <input :id="`field-${index}`" type="checkbox" :checked="field.value" @change="checkboxChanged(field, $event)" required>
                  <span class="checkmark">
                    <svg class="svg-checkmark" xmlns="http://www.w3.org/2000/svg" width="35" height="35" viewBox="0 0 35 35" fill="none">
                      <path class="checkmark-path" d="M5.83301 18.9585L13.1247 26.2502L29.1663 10.2085" stroke="white" stroke-width="3" stroke-linecap="round" stroke-dasharray="32.99833297729492" stroke-dashoffset="32.99833297729492"/>
                    </svg>
                  </span>
                  <p>{{ field.field_name }}</p>
                </label>
              </div>
            </div>
          </div>

        </div>
        <div class="container-global-form-edit width-container_for_butt">
          <button
              class="global-form-edit"
              type="submit"
              :class="{ 'button-disabled': !isCheckboxChecked }"
              :disabled="!isCheckboxChecked">
            <span class="edit-link">Надіслати</span>
          </button>
        </div>
      </form>
      <div v-else>
        <p>Завантаження форми...</p>
      </div>
    </div>

    <!-- Рендеринг для типу форми "primary_poll_individual" -->
    <div v-if="formType === 'primary_poll_individual'">
      <div class="title_form_from_user">
        <p>
          Первинне опитування для клієнта терапевтичного альянсу
        </p>
      </div>

      <!-- спеціальна розмітка для первинного опитування індивідуального -->
      <form v-if="formFields.length > 0" @submit.prevent="submitForm">

        <div class="container-text-for-form">
<!--          <div class="title_n_text">-->
<!--            <b>Інформована згода психологічного консультування</b>-->
<!--            <p>-->
<!--              Цей документ інформує людину, що шукає допомоги у вирішенні психологічних або життєвих труднощів, іменована надалі як «Клієнт / ка», про особливості психологічного консультування та умови надання послуг.-->
<!--            </p>-->
<!--          </div>-->
          <div class="content_user_form">
            <span>Доброго дня, шановний клієнт.</span>
            <p>
              Пропоную вам пройти первинне опитування. Дане опитування допоможе мені краще зрозуміти вас та вашу життєву історію перед початком нашої спільної з вами роботи. Дане опитування складається з базових питань та серії незакінчених речень.  Деякі питання можуть здаватися вам дивними, проте я прошу відповідати перше, що спало на думку та не пропустити жодного пункту. Ваші відповіді Ми обов’язково обговоримо на консультативній сесії.
            </p>
            <span>
              Відповіді на дані твердження займуть 15 хв.
            </span> <br> <br>
            <span>
              Будь ласка, будьте чесними з собою та спробуйте відпустити «контроль відповідей».
            </span> <br><br>
          </div>
        </div>

        <div v-for="(field, index) in formFields" :key="index">

          <!-- Для не-boolean типів поля -->
          <div v-if="field.field_type !== 'boolean'" class="input-field-text">
            <div class="container-input_froms_user">
              <label :for="`field-${index}`">{{ field.field_name }}</label>
              <input :id="`field-${index}`" type="text" v-model="field.value" placeholder="Ваша відповідь"/>
            </div>
          </div>

          <!-- Для boolean типів поля -->
          <div v-if="field.field_type === 'boolean'" class="checkbox-field">
            <div class="container-input center_group">
              <div class="checkbox-group width-input-1200">
                <label class="custom-checkbox" :for="`field-${index}`">
                  <!--                  <input :id="`field-${index}`" type="checkbox" v-model="field.value"  required>-->
                  <input :id="`field-${index}`" type="checkbox" :checked="field.value" @change="checkboxChanged(field, $event)">
                  <span class="checkmark">
                    <svg class="svg-checkmark" xmlns="http://www.w3.org/2000/svg" width="35" height="35" viewBox="0 0 35 35" fill="none">
                      <path class="checkmark-path" d="M5.83301 18.9585L13.1247 26.2502L29.1663 10.2085" stroke="white" stroke-width="3" stroke-linecap="round" stroke-dasharray="32.99833297729492" stroke-dashoffset="32.99833297729492"/>
                    </svg>
                  </span>
                  <p>{{ field.field_name }}</p>
                </label>
              </div>
            </div>
          </div>

        </div>
        <div class="container-global-form-edit width-container_for_butt">
          <button
              class="global-form-edit"
              type="submit"
          >
            <span class="edit-link">Надіслати</span>
          </button>
        </div>
      </form>
      <div v-else>
        <p>Завантаження форми...</p>
      </div>
    </div>

    <!-- Рендеринг для типу форми "primary_poll_individual" -->
    <div v-if="formType === 'primary_poll_couple'">
      <div class="title_form_from_user">
        <p>
          Первинне опитування пари терапевтичного альянсу
        </p>
      </div>

      <!-- спеціальна розмітка для первинного опитування індивідуального -->
      <form v-if="formFields.length > 0" @submit.prevent="submitForm">

        <div class="container-text-for-form">
          <!--          <div class="title_n_text">-->
          <!--            <b>Інформована згода психологічного консультування</b>-->
          <!--            <p>-->
          <!--              Цей документ інформує людину, що шукає допомоги у вирішенні психологічних або життєвих труднощів, іменована надалі як «Клієнт / ка», про особливості психологічного консультування та умови надання послуг.-->
          <!--            </p>-->
          <!--          </div>-->
          <div class="content_user_form">
            <span>Доброго дня, шановний клієнт.</span>
            <p>
              Пропоную вам пройти первинне опитування сімейної парної консультації. Дане опитування допоможе мені краще зрозуміти вас та вашу сімейну історію перед початком нашої спільної з вами роботи. Дане опитування складається з базових питань та серії незакінчених речень.  Деякі питання можуть здаватися вам дивними, проте я прошу відповідати перше, що спало на думку та не пропустити жодного пункту. Будь ласка до сімейної консультації не обговорюйте з партнером відповідей, що були дані на первинному опитуванні.
              Ми обов’язково все обсудимо на консультативній сесії.
            </p>
            <span>
              Відповіді на дані твердження займуть 15 хв.
            </span>
            <span>
              Опитування є конфіденційним. Вся інформація отримана шляхом опитування захищена Етичним кодексом психолога (Розділ VI. п.4.1.)
            </span> <br><br>
            <span>
              Будь ласка, будьте чесними з собою та спробуйте відпустити «контроль відповідей».
            </span> <br><br>
          </div>
        </div>

        <div v-for="(field, index) in formFields" :key="index">

          <!-- Для не-boolean типів поля -->
          <div v-if="field.field_type !== 'boolean'" class="input-field-text">
            <div class="container-input_froms_user">
              <label :for="`field-${index}`">{{ field.field_name }}</label>
              <input :id="`field-${index}`" type="text" v-model="field.value" placeholder="Ваша відповідь"/>
            </div>
          </div>

          <!-- Для boolean типів поля -->
          <div v-if="field.field_type === 'boolean'" class="checkbox-field">
            <div class="container-input center_group">
              <div class="checkbox-group width-input-1200">
                <label class="custom-checkbox" :for="`field-${index}`">
                  <!--                  <input :id="`field-${index}`" type="checkbox" v-model="field.value"  required>-->
                  <input :id="`field-${index}`" type="checkbox" :checked="field.value" @change="checkboxChanged(field, $event)">
                  <span class="checkmark">
                    <svg class="svg-checkmark" xmlns="http://www.w3.org/2000/svg" width="35" height="35" viewBox="0 0 35 35" fill="none">
                      <path class="checkmark-path" d="M5.83301 18.9585L13.1247 26.2502L29.1663 10.2085" stroke="white" stroke-width="3" stroke-linecap="round" stroke-dasharray="32.99833297729492" stroke-dashoffset="32.99833297729492"/>
                    </svg>
                  </span>
                  <p>{{ field.field_name }}</p>
                </label>
              </div>
            </div>
          </div>

        </div>
        <div class="container-global-form-edit width-container_for_butt">
          <button
              class="global-form-edit"
              type="submit"
          >
            <span class="edit-link">Надіслати</span>
          </button>
        </div>
      </form>
      <div v-else>
        <p>Завантаження форми...</p>
      </div>
    </div>




    <!-- Рендеринг, коли тип форми не відповідає жодному визначеному варіанту -->
    <div class="none-content" v-if="formType !== 'consent_couple' && formType !== 'consent_individual' &&
               formType !== 'primary_poll_couple' && formType !== 'primary_poll_individual'
    ">
      <span>Неідентифікований тип форми</span>
    </div>
  </div>
</template>

<script>
import { ref, onMounted } from 'vue';
import apiService from "@/services/apiService";
import M from 'materialize-css';

export default {
  setup() {
    const formFields = ref([]);
    const formType = ref([]);
    const clientId = ref(null);
    const templateId = ref(null);
    const isCheckboxChecked= ref(false);

    onMounted(async () => {
      const queryParams = new URLSearchParams(window.location.search);
      clientId.value = queryParams.get('client');
      templateId.value = queryParams.get('template');
      await fetchFormData();
    });

    const fetchFormData = async () => {
      if (templateId.value) {
        try {
          const response = await apiService.getCustomFormById(templateId.value);
          formFields.value = response.data.data.form_items;
          formType.value = response.data.data.form_type;
          console.log(formFields.value);
          console.log(response.data);
        } catch (error) {
          console.error('Error fetching form data:', error);
        }
      }
    };

    // функція оновилює обидва стани, коли чекбокс буде змінено
    const checkboxChanged = (field, event) => {
      const isChecked = event.target.checked;
      field.value = isChecked; // Оновлюємо значення поля
      isCheckboxChecked.value = isChecked; // Оновлюємо глобальний стан чекбокса
    };

    const submitForm = async () => {
      const answersData = formFields.value.map(field => {
        if (field.field_type === 'boolean') {
          return {
            form_item_id: field.id,
            text_answer: field.value
          };
        } else {
          return {
            form_item_id: field.id,
            text_answer: field.value
          };
        }
      });

      const payload = {
        client_id: clientId.value,
        answers_data: answersData
      };

      try {
        await apiService.submitAnswers(JSON.stringify(payload)); // це ваш попередній запит для надсилання відповідей форми
        M.toast({ html: `Відповіді форми відправлено.` });

        // Тепер перевіряємо тип форми та відправляємо на апі значення true для відповідного поля
        if (formType.value === 'consent_couple' || formType.value === 'consent_individual') {
          if (isCheckboxChecked.value) {
            await apiService.updateClientInformAgree(clientId.value, true);
            M.toast({ html: `Інформовану згоду відправлено.` });
            window.location.href = '/thank-you';
          }
        }
        if (formType.value === 'primary_poll_couple' || formType.value === 'primary_poll_individual') {
          if (isCheckboxChecked.value) {
            await apiService.updateClientPrimaryPoll(clientId.value, true);
            M.toast({ html: `Первинне опитування відправлено.` });
            window.location.href = '/thank-you';
          }
        }

      } catch (error) {
        console.error('Помилка при надсиланні форми:', error);
        M.toast({ html: `Помилка, форму не надіслано: ${error.message}` });
      }
    };


    return {
      formFields,
      formType,
      clientId,
      templateId,
      submitForm,
      isCheckboxChecked,
      checkboxChanged
    };
  }
};
</script>