<template>
  <div class="thank-you-text">
    <p class="title-thank-you">
      Щиро дякуємо Вам за довіру до нас і за виявлену готовність співпрацювати у процесі
      психологічного консультування.
    </p>
    <p>
      Ми цінуємо Ваш вибір і зобов'язуємося забезпечити професійну підтримку,
      спрямовану на Ваше психічне здоров'я та благополуччя. Якщо у вас виникнуть додаткові питання або ви захочете поділитися додатковою інформацією, будь ласка, не вагайтесь зв'язатися з нами.
    </p>
  </div>
</template>
<script>

</script>